In [1]:
import requests
import PyPDF2  
import camelot

In [2]:
url = "https://nirfcdn.azureedge.net/2020/pdf/Engineering/IR-E-U-0456.pdf"

In [3]:
data=requests.get(url)

In [17]:
with open('IR-E-U-0456.pdf','wb') as f:
    f.write(data.content)

In [22]:
tables = camelot.read_pdf('IR-E-U-0456.pdf')

In [24]:
tables.n

3

In [100]:
int(tables[1].df[1][1])

1814

In [102]:
tables[1].df

,0,1,2,3,4,5,6,7,8,9,10,11,12
0,(All programs\nof all years),No. of Male\nStudents,No. of Female\nStudents,Total Students,Within State\n(Including male\n& female),Outside State\n(Including male\n& female),Outside\nCountry\n(Including male\n& female),Economically\nBackward\n(Including male\n& fem...,Socially\nChallenged\n(SC+ST+OBC\nIncluding ma...,No. of students\nreceiving full\ntuition fee\n...,No. of students\nreceiving full\ntuition fee\n...,No. of students\nreceiving full\ntuition fee\n...,No. of students\nwho are not\nreceiving full\n...
1,UG [4 Years\nProgram(s)],1814,272,2086,533,1529,24,199,1105,47,938,100,219
2,UG [5 Years\nProgram(s)],1753,281,2034,441,1574,19,198,1041,26,1001,42,170
3,PG [2 Year\nProgram(s)],898,146,1044,173,870,1,306,467,0,724,43,6
4,PG [3 Year\nProgram(s)],612,127,739,246,493,0,299,211,5,406,72,27

In [94]:
table[8][3]

'1360000(Rupees\nThirteen Lakhs Sixty\nthousand)'

In [103]:
url.split('/')[-1]

'IR-E-U-0456.pdf'

In [166]:
x = tables[2].df

In [174]:
x[2][3]

'458'

In [154]:
x

,0,1,2,3,4,5,6,7,8,9
0,Academic Year,No. of first year\nstudents intake in the\nyear,No. of first year\nstudents admitted in\nthe year,Academic Year,No. of students\nadmitted through\nLateral entry,Academic Year,No. of students\ngraduating in\nminimum stipul...,No. of students\nplaced,Median salary of\nplaced\ngraduates(Amount in\...,No. of students\nselected for Higher\nStudies
1,2013-14,446,439,2014-15,0,2016-17,437,288,1020000(Rupees Ten\nlakhs and Twenty\nthousand),102
2,2014-15,466,441,2015-16,0,2017-18,334,283,1306000(Rupees\nThirteen lakhs six\nthousand o...,51
3,2015-16,466,458,2016-17,0,2018-19,362,268,1360000(Rupees\nThirteen Lakhs Sixty\nthousand),65